demos/java-server/lib/com/example/farandula-example/1.3.2/farandula-example-1.3.2/travelport/XML.request/airPricing.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v34_0" AuthorizedBy="user" TargetBranch="${targetBranch}" TraceId="trace">
            <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v34_0" OriginApplication="UAPI"/>
            <air:AirItinerary>
                <air:AirSegment Key="${key}"
                                Group="${group}"
                                Carrier="${carrier}"
                                FlightNumber="${flightNumber}"
                                Origin="${origin}"
                                Destination="${destination}"
                                DepartureTime="${departureTime}"
                                ArrivalTime="${arrivalTime}"
                                FlightTime="${flightTime}"
                                TravelTime="${travelTime}"
                                Equipment="${equipment}"
                                ETicketability="Yes"
                                ChangeOfPlane="false"
                                ParticipantLevel="Secure Sell"
                                LinkAvailability="true"
                                PolledAvailabilityOption="Polled avail used"
                                OptionalServicesIndicator="false"
                                AvailabilitySource="S"
                                AvailabilityDisplayType="General"
                                ProviderCode="1G"/>
            </air:AirItinerary>
            <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v34_0" BookingTravelerRef="gr8AVWGCR064r57Jt0+8bA==" Code="ADT"/>
            <air:AirPricingCommand CabinClass="Economy"/>
        </air:AirPriceReq>
    </soapenv:Body>
</soapenv:Envelope>